[
  {
    "title": "1984",
    "text": "A dystopian novel set in a totalitarian regime where the government, led by Big Brother, uses surveillance and propaganda to control citizens' thoughts and actions."
  },
  {
    "title": "To Kill a Mockingbird",
    "text": "Set in the 1930s, this novel follows Scout Finch as she navigates her childhood in a racially segregated Southern town, learning about morality, prejudice, and justice."
  },
  {
    "title": "The Great Gatsby",
    "text": "A tale of love, obsession, and betrayal set in the Jazz Age, the novel explores the life of Jay Gatsby and his attempt to win back his lost love, Daisy Buchanan."
  },
  {
    "title": "Moby-Dick",
    "text": "The epic journey of Captain Ahab, who relentlessly pursues the white whale, Moby Dick, exploring themes of obsession, revenge, and the dangers of single-minded pursuit."
  },
  {
    "title": "Pride and Prejudice",
    "text": "In this classic novel, Elizabeth Bennet navigates societal expectations, personal growth, and romance, particularly her relationship with the proud Mr. Darcy."
  },
  {
    "title": "The Catcher in the Rye",
    "text": "The story of Holden Caulfield, a disillusioned teenager who struggles with the complexities of growing up, identity, and loss in the post-war era."
  },
  {
    "title": "The Lord of the Rings",
    "text": "A high fantasy epic that follows the journey of Frodo Baggins and his companions as they attempt to destroy the One Ring and defeat the dark lord Sauron."
  },
  {
    "title": "The Hunger Games",
    "text": "In a dystopian future, Katniss Everdeen volunteers to take her sister’s place in a brutal televised fight to the death, challenging the oppressive system of the Capitol."
  },
  {
    "title": "Brave New World",
    "text": "Set in a futuristic society, the novel explores themes of conformity, consumerism, and the loss of individuality in a world that prioritizes happiness through technology and social control."
  },
  {
    "title": "Animal Farm",
    "text": "A political allegory that satirizes the Russian Revolution and the rise of Stalinism, where farm animals overthrow their human owner only to face oppression from their own kind."
  }
]
